// Задание 1
// void main() {
//     int age = 17;
//     if (age >= 18) {
//         print('Вход разрешен Трипл Т Сахуром');
//     }
//     else{
//         print('Вход лопухам запрещен Трипл Т Сахуром');
//     }
// }
// Задание 2
// import 'dart:io';

// void main() {
//   print('Сколько вам лет?');
//   String input = stdin.readLineSync()!;
//   int age = int.parse(input);
//   if (age >= 18) {
//     print('Проходите в Трипл Т Сахурию');
//   } else {
//     print('Запрещено в Трипл Т Сахурию');
//   }
// }

// Задание 3

// import 'dart:io';

// void main() {
//   stdout.write('Введите Логин');
//   String? login = stdin.readLineSync()!;
//   stdout.write('Введите Пароль');
//   String? password = stdin.readLineSync()!;
//   if(login == 'tripletsahur' && password == 'p1ssword') {
//     print('Проходите Повелитель Трипл t Сахурии');
//   } else {
//     print('Лопухам тут не место');
//   }
// }

// Задание 4
// import 'dart:io';
// void main(){

// int balance = 6767;
// print('Действия Трипл Т Банка:\n1)Баланс\n2)Снять деньги\n3)Пополнить баланс');
// stdout.write('Выберите действие(1-3)');
// String choice = stdin.readLineSync()??'';
// switch(choice) {
//     case '1':
//     print('Ваш баланс в Трипл Т Банке: $balance сиксевенкоинов');
//     case '2':
//     stdout.write('Введите кол-во сиксевенкоинов которые вы хотите вывести из Трипл Т Банк: ');
//     int amount = int.parse(stdin.readLineSync()!);
//     if(amount>balance) {
//         print('Недостаточно средств на вашем Трипл Т Банке');
//     }
//     else{
//         balance = balance - amount;
//         print('Вы сняли $amount сиксевенкоинов\n Ваш Баланс на Трипл Т Банке: $balance');
//     }
//     case '3':
//     stdout.write('Сколько сиксевенкоинов вы хотите положить?');
//     int depositamount = int.parse(stdin.readLineSync()!);
//     if (depositamount <=0){
//         print('Введено недопустимое сиксевенкоинов для пополнение баланса');
//     }else{
//         balance += depositamount;
//         print('Баланс вашего Трипл Т Банка успешно пополнен!\nВаш нынешний баланс сиксевенкоинов: $balance');
//     }
//     default:
//     print('Ошибка: выбран несуществующий пункт в Трипл Т Банке');
// }
// }
import 'dart:io';

void main() {
  int hp = 100;
  bool hasKey = false;
  bool hasRustyKey = false;
  List<String> backpack = [];

  print('Пролог...\nВы проснулись в заброшенной деревне, находящаяся под землей\nУ вас $hp хп и $backpack вещей');
  print('Начало...\nВы вышли из небольшого домика и увидели впереди 2 дома с светом.\nВ какой дом пойдете?\n1)1 домик\n2)2 домик');
  stdout.write('Вы выбрали (1 или 2): ');
  String? choice1 = stdin.readLineSync()?.trim();

  if (choice1 == '1') {
    print('Вы вошли в 1 домик\n Вы нашли там меч и ржавый ключ(возможно пригодится)');
    print('Вы спускаетесь в подвал и видите в конце коридора красный свет.\nПойдете туда или вернетесь обратно?\n1)Пойти\n2)Вернуться');
    stdout.write('Вы выбрали (1 или 2): ');
    String? choice2 = stdin.readLineSync()?.trim();

    if (choice2 == '1') {
      print('Вы видите яблоко стоящее на столе, а вокруг светят кровавые лампы.\nСъесть яблоко?\n1)Съесть\n2)Не есть');
      stdout.write('Вы выбрали (1 или 2): ');
      String? choice3 = stdin.readLineSync()?.trim();

      if (choice3 == '1') {
        print('Вы съедаете яблоко, но оно оказывается отравленным.\nВы погибаете.\n==ПОРАЖЕНИЕ==\nДля того чтобы начать завоно напишите "dart run"');
      } else if (choice3 == '2') {
        print('Вы не съедаете яблоко, но вы слышите шаги и готовитесь к бою.\nК вам приблежается огромный Огр.\nУ вас начинается битва.\nОгр ваншотит вас и вы погибаете.\n==ПОРАЖЕНИЕ==\nДля того чтобы начать завоно напишите "dart run"');
      } else {
        print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
      }
    } else if (choice2 == '2') {
      hasRustyKey = true;
      backpack = ['Меч'];
      print('Вы вышли обратно на улицe, теперь у вас есть меч и ржавый ключ.\nВы видите 2х гоблинов одетые как городские бандиты.\nНачать бой с ними(Падает небольшой дроп с мелких врагов)\n1)Начать бой.\n2)Зайти обратно в дом, ожидая пока они уйдут.');
      stdout.write('Вы выбрали (1 или 2): ');
      String? choice4 = stdin.readLineSync()?.trim();

      if (choice4 == '1') {
        print('Мелкий гоблин=бандит атакует вас и наносит 10 урона.\nВаш ход:\n1)Использовать способность "Удар по двоим"\n2)Нанести увеличенный урон, но только по маленькому врагу.');
        stdout.write('Вы выбрали (1 или 2): ');
        String? choice5 = stdin.readLineSync()?.trim();

        if (choice5 == '1') {
          print('Вы наносите 30 урона маленькому Гоблину-бандиту и 26 урона среднему Гоблину-бандиту.\nХод среднего врага\nСредний Гоблин-бандит наносит вам 60 урона и накладывает эффект "Кровотечение"');
          print('Вы не находите у себя "Лечебный лист" для заживление ран и погибаете.\n==ПОРАЖЕНИЕ==\nДля того чтобы начать завоно напишите "dart run"');
        } else if (choice5 == '2') {
          print('Вы убиваете маленького Гоблина-бандита.\nСредний Гоблин-бандит получает дебаффы "Уменьшенный урон" и "Увелечение урона от врагов" от потери союзника\nВаш ход:\n1)Использовать способность:х2 урон по последнему врагу(после этого меч нельзя использовать 3 хода)\n2)Убежать получив "Неизвестный" лут с мелкого врага');
          stdout.write('Вы выбрали (1 или 2): ');
          String? choice6 = stdin.readLineSync()?.trim();

          if (choice6 == '1') {
            backpack = ['Лист Лечения', 'Лист Лечения'];
            hasKey = true;
            hp = 90;
            print('Вы убиваете среднего Гоблина-бандита.\nТеперь у вас есть 2 "Лист Лечения" и "Ключ"\nВы хотите уйти в следующий дом, но слышите рык байков и в далеке видете банду Гоблинов-бандитов');
            print('Вы прячитесь за кустами, но вас находят и вы погибаете.\n==ПОРАЖЕНИЕ==\nДля того чтобы начать завоно напишите "dart run"');
          } else if (choice6 == '2') {
            print('Вы получили ключ.\nВы убежали в дом со светом, который еще не заходили.\nВы видите там сундук.\nОткрыв его вы находите 5 растений под названием "Tango"(восстанавливают по 6-7 здоровью за 1 ход. Действует 2 хода)');
            print('Вы видете чердак и идете туда.\nТам валяется много мусора.\nВы замечаете дверь которая закрыта на ржавый замок.\nВы используете "Ржавый ключ".\nЗайти ли в дверь?');
            print('1)Войти.\n2)Не входить');
            stdout.write('Вы выбрали (1 или 2): ');
            String? choice7 = stdin.readLineSync()?.trim();

            if (choice7 == '1') {
              hasRustyKey = false;
              print('Вы заходите туда и падаете в бездну, потеряв сознание.\n==СПУСТЯ КАКОЕ-ТО ВРЕМЯ==\nВы просыпаетесь.\nОглядываясь вы видите щит и камень.');
              print('Из-за того что вы не понимаете что происходит, вы решаетесь взять их.\nПодняв вещи вы осматриваете огромное помещение в котормо находитесь.\nСпустя некоторое время вы находите потайную дверь, которую почти не видно.');
              print('Вы пытаетесь ее выломать, но у вас не получается.\nВы сидите в безысходности и погибаете из-за голода и жажды.\n==ПОРАЖЕНИЕ==\nДля того чтобы начать завоно напишите "dart run"');
            } else if (choice7 == '2') {
              hasRustyKey = false;
              print('Вы не входите в дверь, а просто кидаете мусор который валяется везде на чердаке.\nПодождав минуту вы таки не слышите никакого стука от мусора, кинутого вами в дверь\nВы уходите.');
              print('Вы спускаетесь и смотрите в окно.\nВы увидели проезжающую мимо банду Гоблин-бандитов.\nПосле того как они проехали мимо дома вы замечаете на улице загадочный порошок.');
              print('Вы решаетесь его подобрать\nЧто вы хотите с ним сделать?\n1)Использовать на себя.\n2)Рассыпать на пол.');
              stdout.write('Вы выбрали (1 или 2): ');
              String? choice8 = stdin.readLineSync()?.trim();

              if (choice8 == '1') {
                print('Вы чувствуете какое то облегчение в течении 2 часов.\nПосле вы засыпаете и больше не просыпаетесь, гния в доме до конца Земли.\n==ПОРАЖЕНИЕ==\nДля того чтобы начать завоно напишите "dart run"');
              } else if (choice8 == '2') {
                backpack = ['Щит'];
                print('Рассыпав на пол, вы чувствуете какую-то тряску.\nВыйдя на улицу вы замечаете, что дом начал летать.\nВы в ожидание смерти сидите в доме и ждете ее.\nСпустя около 10 часов вы перестаете чувствовать тряску.');
                print('Выглянув в окно вы понимаете что перед вами огромный Замок.\nВы заходите в сам Замок и замечаете что внутри него есть только дверь с замком\n');
                print('Вам все равно не остается ничего кроме как отпереть дверь, ибо вы просто умрете от голода и жажды.');
                print('Внутри вы видите стол с вкусной едой, камнем и щитом.\nВы как бешенный едите все что находится на столе.\nНаевшись, вы берете камень и точите об него свой меч, а также захватываете с собой щит.');
                print('Так как комната оказывается пустой вы засыпаете, ведь давно не спали.\nВыспавшись вы замечаете что все пропала и комната стала очень огромной.');
                print('Вы осматриваетесь и видите в конце этого помещения рычаг.\nДернуть его?\n1)ДА.\n2)ДА');
                stdout.write('Вы выбрали (1 или 2): ');
                String? choice9 = stdin.readLineSync()?.trim();

                if (choice9 == '1' || choice9 == '2') {
                  print('Открывается дверь находящаяся напротив рычага и оттуда выходит Лев под именем "Брандашмыг".\nНачинается битва.');
                  print('Брандашмыг нападает на вас, но вы уклоняетесь.\nЧто использовать?\n1)Удар с кровотечением(Наносит % урон от максимального здоровья врага. Атакой нельзя промазать).\n2)Размахивать мечом 3 раза нанося урон по области(шанс в 20% не попасть по врагу).\n3)Обычная серия ударов.');
                  stdout.write('Вы выбрали (1, 2 или 3): ');
                  String? choice10 = stdin.readLineSync()?.trim();

                  if (choice10 == '1') {
                    print('Вы наносите огромный урон Брандашмыгу, он отходит вылизывая свои раны и пропускает 2 хода.\nВаш ход:\n1)Удар с кровотечением(Наносит % урон от максимального здоровья врага. Атакой нельзя промазать).\n2)Размахивать мечом 3 раза нанося урон по области(шанс в 20% не попасть по врагу).');
                    stdout.write('Вы выбрали (1 или 2): ');
                    String? choice11 = stdin.readLineSync()?.trim();

                    if (choice11 == '1') {
                      print('Вы одолели Брандашмыга.\nС воздуха появляется надпись, что вам пора просыпаться.\nВы не понимаете что это и через секунду вырубаетесь\nВы проснулись.');
                      print('Вы поняли что это был лишь сон.\n==КОНЕЦ==ИСТИННАЯ КОНЦОВКА==\n==Спасибо за прохождение "строковой" игры.==');
                    } else if (choice11 == '2') {
                      print('"Зачем использовать этот мусор когда есть крутая способность??"\nПод смех зрителей на вас падает наковальня и вы умираете');
                      print('==ПОРАЖЕНИЕ==\nСамая глупая смерть из доступных\nДля того чтобы начать завоно напишите "dart run"');
                    } else {
                      print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
                    }
                  } else if (choice10 == '2' || choice10 == '3') {
                    print('"Зачем использовать этот мусор когда есть крутая способность??"\nПод смех зрителей на вас падает наковальня и вы умираете');
                    print('==ПОРАЖЕНИЕ==\nСамая глупая смерть из доступных\nДля того чтобы начать завоно напишите "dart run"');
                  } else {
                    print('Ошибка! Введен неверный вариант (выберите 1, 2 или 3).');
                  }
                } else {
                  print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
                }
              } else {
                print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
              }
            } else {
              print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
            }
          } else {
            print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
          }
        } else {
          print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
        }
      } else if (choice4 == '2') {
        print('Вы решили зайти обратно в дом и подождать...');
      } else {
        print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
      }
    } else {
      print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
    }
  } else if (choice1 == '2') {
    print('Войдя в 2 дом вы видете сундук.\nОттуда вы достаете 5 растеньев "Tango"(восстанавливают по 6-7 здоровью за 1 ход. Действует 2 хода)\nВы поднялись на чердак, но увидели в нем только один мусор');
    print('Порыскав вы увидели дверь которая находится под замком.\nВы пытаетесь его сломать и у вас получается.\nВы видете там бездну и уже хотите прыгнуть, но замечаете за спиной летающее существо которое говорит "Читерить не честно" и у вас останавливается сердце.');
    print('==ПОРАЖЕНИЕ==\n==Самая быстрая смерть из возможных.==\nДля того чтобы начать завоно напишите "dart run"');
  } else {
    print('Ошибка! Введен неверный вариант (выберите 1 или 2).');
  }
}